Revit 2027 API
ParameterTypeId.StairsWinderpatternStairPathOffset Property
 "Inside Walk Line Offset": The offset from inside walk line to interior boundary
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsWinderpatternStairPathOffset { get; }
Public Shared ReadOnly Property StairsWinderpatternStairPathOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsWinderpatternStairPathOffset {
	ForgeTypeId^ get ();
}
static member StairsWinderpatternStairPathOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace